[
    {
        "id": 1,
        "repetition": 3,
        "arabic": "  قُلْ هُوَ اللهُ أَحَدٌ، اللّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ،  وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ "
    },
    {
        "id": 2,
        "repetition": 3,
        "arabic": "  قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِنْ شَرِّ مَا خَلَقَ، وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ "
    },
    {
        "id": 3,
        "repetition": 3,
        "arabic": " قُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ إِلَهِ النَّاسِ، مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ، مِنَ الْجِنَّةِ وَالنَّاسِ "
    },
    {
        "id": 4,
        "repetition": 3,
        "arabic": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ "
    },
    {
        "id": 5,
        "repetition": 1,
        "arabic": "أَفَحَسِبْتُم أَنَّمَا  خَلَقْنَاكُمْ عَبَثًا وَأَنَّكُمْ إِلَيْنَا لَا تُرْجَعُونَ، فَتَعَلَى اللَّهُ المَلِكُ الحَقُّ لَا إِلَهَ إِلَّا هُوَ رَبُّ العَرْشِ الكَرِيمِ، وَمَن يَدْعُ مَعَ اللَّهِ إِلَهَا آخَرَ لَا بُرْهَانَ لَهُ بِهِ فَإِنَّمَا حِسَابُهُ عِندَ رَبِّهِ إِنَّهُ لَا يُفْلِحُ الْكَافِرُونَ، وَقُلْ رَبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ"
    },
    {
        "id": 6,
        "repetition": 1,
        "arabic": "فسبحانَ اللهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ، وَلَهُ الْحَمْدُ فِي السَّمَواتِ وَالْأَرْضِ وَعَشِيَّا وَحِينَ تُظْهِرُونَ، يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَيُخْرِجُ المَيِّتَ مِنَ الحَيِّ ويُحْيِي الأَرْضَ بَعْدَ مَوْتِهَا وَكَذَلِكَ تُخْرَجُونَ"
    },
    {
        "id": 7,
        "repetition": 3,
        "arabic": "أَعُوْذُ بِٱللّٰهِ ٱلسَّمِيعِ ٱلْعَلِيْمِ مِنَ ٱلشَّيْطَانِ ٱلرَّجِيمِ"
    },
    {
        "id": 8,
        "repetition": 1,
        "arabic": "لَوْ أَنْزَلْنَا هَٰذَا الْقُرْآنَ عَلَىٰ جَبَلٍ لَرَأَيْتَهُ خَاشِعًا مُتَصَدِّعًا مِنْ خَشْيَةِ اللَّـهِ ۚ وَتِلْكَ الْأَمْثَالُ نَضْرِبُهَا لِلنَّاسِ لَعَلَّهُمْ يَتَفَكَّرُونَ ﴿٢١﴾هُوَ اللَّـهُ الَّذِي لَا إِلَـٰهَ إِلَّا هُوَ ۖ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ ۖ هُوَ الرَّحْمَـٰنُ الرَّحِيمُ ﴿٢٢﴾"
    },
    {
        "id": 9,
        "repetition": 1,
        "arabic": "هُوَ اللَّـهُ الَّذِي لَا إِلَـٰهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ ۚ سُبْحَانَ اللَّـهِ عَمَّا يُشْرِكُونَ ﴿٢٣﴾هُوَ اللَّـهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ ۖ لَهُ الْأَسْمَاءُ الْحُسْنَىٰ ۚ يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ."
    },
    {
        "id": 10,
        "repetition": 1,
        "arabic": "سلامٌ على نُوحٍ في العالَمين، إنَّا كذلكَ نَجْزِي المُحْسِنِينَ، إنَّهُ مِنْ عِبَادِنَا المُؤْمِنِينَ"
    },
    {
        "id": 11,
        "repetition": 3,
        "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ."
    },
    {
        "id": 12,
        "repetition": 3,
        "arabic": "بِسْمِ اللهِ الذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ، وَهُوَ السَّمِيعُ الْعَلِيمُ"
    },
    {
        "id": 13,
        "repetition": 3,
        "arabic": "اللَّهُمَّ إِنِّي أَصْبَحْتُ مِنْكَ فِي نِعْمَةٍ وَعَافِيَةٍ وَسِتْرٍ، فَأَتِمَّ نِعْمَتَكَ عَلَيَّ وَعَافِيَتَكَ وَسِتْرَكَ فِي الدُّنْيَا وَالآخِرَةِ."
    },
    {
        "id": 14,
        "repetition": 4,
        "arabic": "اللَّهُمَّ، إِنِّي أَصْبَحْتُ أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ وَمَلائِكَتَكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللهُ، لا إِلهَ إِلَّا أَنْتَ، وَحْدَكَ لا شَرِيكَ لَكَ، وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ."
    },
    {
        "id": 15,
        "repetition": 3,
        "arabic": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ، حَمْدًا يُوَافِي نِعَمَهُ وَيُكَافِئُ مَزِيدَهُ."
    },
    {
        "id": 16,
        "repetition": 3,
        "arabic": "آمَنْتُ بِاللهِ الْعَظِيمِ، وَكَفَرْتُ بِالْجِبْتِ وَالطَّاغُوتِ، وَاِسْتَمْسَكْتُ بِالْعُرْوَةِ الْوُثْقَى لاَ انفِصَامَ لَهَا، وَاللهُ سَمِيعٌ عَلِيمٌ."
    },
    {
        "id": 17,
        "repetition": 3,
        "arabic": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلامِ دِينًا، وَبِسَيِّدِنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ نَبِيًّا وَرَسُولًا."
    },
    {
        "id": 18,
        "repetition": 7,
        "arabic": "حَسْبِيَ اللَّهُ، لَا إِلَهَ إِلَّا هُوَ، عَلَيْهِ تَوَكَّلْتُ، وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ."
    },
    {
        "id": 19,
        "repetition": 10,
        "arabic": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ، وَعَلَى آلِهِ وَصَحْبِهِ، وَسَلِّمْ."
    },
    {
        "id": 20,
        "repetition": 1,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَجْأَةِ الْخَيْرِ، وَأَعُوذُ بِكَ مِنْ فَجْأَةِ الشَّرِّ."
    },
    {
        "id": 21,
        "repetition": 1,
        "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي، وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ."
    },
    {
        "id": 22,
        "repetition": 1,
        "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ، عَلَيْكَ تَوَكَّلْتُ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ، مَا شَاءَ اللَّهُ كَانَ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، لا حَوْلَ وَلا قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ."
    },
    {
        "id": 23,
        "repetition": 1,
        "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ."
    },
    {
        "id": 24,
        "repetition": 1,
        "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ."
    },
    {
        "id": 25,
        "repetition": 1,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ."
    },
    {
        "id": 26,
        "repetition": 1,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ وَالْمَعَافَاةَ الدَّائِمَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي."
    },
    {
        "id": 27,
        "repetition": 1,
        "arabic": "اللهمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي."
    },
    {
        "id": 28,
        "repetition": 1,
        "arabic": "اللَّهُمَّ، اِحْفَظْنِي مِنْ بَيْنِ يَدَيْ وَمِنْ خَلْفِي وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أَغْتَالَ مِنْ تَحْتِي."
    },
    {
        "id": 29,
        "repetition": 1,
        "arabic": "اللَّهُمَّ، أَنْتَ خَلَقْتَنِي وَأَنْتَ تَهْدِينِي وَأَنْتَ تُطْعِمُنِي وَأَنْتَ تَسْقِينِي وَأَنْتَ تُمِيتُنِي وَأَنْتَ تُحْيِينِي وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ."
    },
    {
        "id": 30,
        "repetition": 1,
        "arabic": "أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا، وَمَا كَانَ مِنَ الْمُشْرِكِينَ."
    },
    {
        "id": 31,
        "repetition": 1,
        "arabic": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَعَلَيْكَ نَتَوَكَّلُ، وَإِلَيْكَ النُّشُورُ."
    },
    {
        "id": 32,
        "repetition": 1,
        "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ."
    },
    {
        "id": 33,
        "repetition": 1,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ: فَتْحَهُ، وَنَصْرَهُ، وَنُورَهُ، وَبَرَكَتَهُ، وَهُدَاهُ."
    },
    {
        "id": 34,
        "repetition": 1,
        "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ وَخَيْرَ مَا قَبْلَهُ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ."
    },
    {
        "id": 35,
        "repetition": 1,
        "arabic": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ، لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ عَلَى ذَلِكَ."
    },
    {
        "id": 36,
        "repetition": 1,
        "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ."
    },
    {
        "id": 37,
        "repetition": 1,
        "arabic": "سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ."
    },
    {
        "id": 38,
        "repetition": 1,
        "arabic": "سُبْحَانَ اللَّهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، سُبْحَانَ اللَّهِ عَدَدَ مَا خَلَقَ فِي الْأَرْضِ، سُبْحَانَ اللَّهِ عَدَدَ مَا بَيْنَ ذَلِكَ، سُبْحَانَ اللَّهِ عَدَدَ مَا هُوَ خَالِقٌ."
    },
    {
        "id": 39,
        "repetition": 1,
        "arabic": "الْحَمْدُ لِلَّهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، الْحَمْدُ لِلَّهِ عَدَدَ مَا خَلَقَ فِي الْأَرْضِ، الْحَمْدُ لِلَّهِ عَدَدَ مَا بَيْنَ ذَلِكَ، الْحَمْدُ لِلَّهِ عَدَدَ مَا هُوَ خَالِقٌ."
    },
    {
        "id": 40,
        "repetition": 1,
        "arabic": "لا إِلَٰهَ إِلاَّ اللَّٰهُ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، لا إِلَٰهَ إِلاَّ اللَّٰهُ عَدَدَ مَا خَلَقَ فِي الْأَرْضِ، لا إِلَٰهَ إِلاَّ اللَّٰهُ عَدَدَ مَا بَيْنَ ذَلِكَ، لا إِلَٰهَ إِلاَّ اللَّٰهُ عَدَدَ مَا هُوَ خَالِقٌ."
    },
    {
        "id": 41,
        "repetition": 1,
        "arabic": "اللهُ أَكْبَرُ عَدَدُ مَا خَلَقَ فِي السَّمَاءِ، اللهُ أَكْبَرُ عَدَدُ مَا خَلَقَ فِي الْأَرْضِ، اللهُ أَكْبَرُ عَدَدُ مَا بَيْنَ ذَلِكَ، اللهُ أَكْبَرُ عَدَدُ مَا هُوَ خَالِقٌ."
    },
    {
        "id": 42,
        "repetition": 1,
        "arabic": "لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيْمِ، عَدَدَ مَا خَلَقَ فِي السَّمَاءِ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيْمِ، عَدَدَ مَا خَلَقَ فِي الأَرْضِ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيْمِ، عَدَدَ مَا بَيْنَ ذَلِكَ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيْمِ، عَدَدَ مَا هُوَ خَالِقٌ\""
    },
    {
        "id": 43,
        "repetition": 1,
        "arabic": "لا إلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، عَدَدَ دُ كُلِّ ذَرَّةٍ أَلْفَ مَرَّةٍ."
    },
    {
        "id": 44,
        "repetition": 1,
        "arabic": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ مَفْتَاحِ بَابِ رَحْمَةِ اللَّهِ عَدَدَ مَا فِي عِلْمِ اللَّهِ، صَلَاةً وَسَلَامًا دَائِمِيْنَ بِدَوَامِ مُلْكِ اللَّهِ، وَعَلَى آلِهِ وَصَحْبِهِ، عَدَدَ كُلِّ ذَرَّةٍ أَلْفَ مَرَّةٍ."
    }
]